RAFHA2413/Control_Navegacion_USV_STM32H562VGT6_v03/Core/Src/main.c
 } 
  } */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_GPDMA1_Init();
  MX_ICACHE_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_USART6_UART_Init();
  MX_I2C1_Init();
  MX_TIM3_Init();
  MX_USART3_UART_Init();
  MX_ADC1_Init();

  /* USER CODE BEGIN 2 */

/*
 * AUTOPRUEBA PB2:
 * Al arrancar, el LED cambia de estado durante 300 ms y vuelve al estado inicial.
 * Si este destello no se ve, el problema esta en PB2/LED y no en la UART.
 */
HAL_GPIO_WritePin(
    LED_RX_TIERRA_GPIO_Port,
    LED_RX_TIERRA_Pin,
    GPIO_PIN_SET);
HAL_Delay(300U);

HAL_GPIO_WritePin(
    LED_RX_TIERRA_GPIO_Port,
    LED_RX_TIERRA_Pin,
    GPIO_PIN_RESET);
HAL_Delay(300U);

// Inicializa la señal PWM en el pin PB0 (SERVO_CAMARA)
SERVO_init(&SERVO1);
SERVO_ANG(&SERVO1, 0.0f); // Posiciona inicialmente la cámara al centro (0°)

/*
 * PRUEBA LOCAL MOTORES 6.2:
 * Inicia únicamente las salidas PWM de propulsion en NEUTRO.
 * No se ejecuta USV_Motor_Calibrar() y no se ordena movimiento.
 * Babor    = PB4 / TIM3_CH1
 * Estribor = PB1 / TIM3_CH4
 */
if ((HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1) == HAL_OK) &&
    (HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4) == HAL_OK))
{
    USV_Motor_Set(&htim3, TIM_CHANNEL_1, PWM_NEUTRO);
    USV_Motor_Set(&htim3, TIM_CHANNEL_4, PWM_NEUTRO);

    motor_babor_pwm_us = PWM_NEUTRO;
    motor_estribor_pwm_us = PWM_NEUTRO;
    motores_pwm_activos = 1U;
}

uartx_write_text(&huart6, "INICIANDO\r\n");
//uartRX_it_idle_dma_init(&UARTRX1);
uartRX_it_idle_dma_init(&GPS_UARTRX);   // USART1 / estacion de tierra
uartRX_it_idle_dma_init(&GNSS_UARTRX);   // USART2 / GPS L76K

// Inicializa la telemetria oficial $PUSVD por USART1 / XBee
TELEMETRIA_USV_init(&TELEMETRIA1);

// Inicializa BNO085
imu_ok = IMU_Init();
imu_addr = IMU_GetAddress7bit();

// Inicializa DS18B20 / 1-Wire en PC2 (TEMPE)
TEMPE_Init();

/*
 * Inicia ADC1 por DMA usando la libreria adc_x.
 * CubeMX tiene 3 conversiones:
 * [0] PA0, [1] PC1, [2] PC3 (humedad).
 * PC2 ya no pertenece al ADC: se usa para DS18B20 / 1-Wire.
 * Se pasa 3 de forma explicita para no modificar la libreria adc_x.
 */
ADC_Read_DMA(&hadc1, 3U, adc1_codigo);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* Lectura IMU cada 50 ms */
    if ((HAL_GetTick() - imu_last_ms) >= 50U)
    {
        imu_last_ms = HAL_GetTick();

        if (IMU_ReadEuler(
                &imu_roll,
                &imu_pitch,
                &imu_yaw) != 0U)
        {
            imu_data_ok = 1U;

            USV_ActualizarTelemetriaIMU(
                imu_roll,
                imu_pitch,
                imu_yaw);
        }
    }

    /*
     * PRUEBA LOCAL SERVO MG996R:
     * Sin estacion de tierra. Usa exclusivamente la libreria servos.
     * Secuencia cada 3 s: -90 -> 0 -> +90 -> 0 grados.
     * No usa HAL_Delay para el movimiento del servo.
     */
    if ((HAL_GetTick() - servo_test_last_ms) >= 3000U)
    {
        servo_test_last_ms = HAL_GetTick();

        switch (servo_test_estado)
        {
            case 0U:
                servo_test_angulo = -90.0f;
                break;

            case 1U:
                servo_test_angulo = 0.0f;
                break;

            case 2U:
                servo_test_angulo = 90.0f;
                break;

            default:
                servo_test_angulo = 0.0f;
                break;
        }

        SERVO_ANG(&SERVO1, servo_test_angulo);

        servo_test_estado++;
        if (servo_test_estado > 3U)
        {
            servo_test_estado = 0U;
        }
    }

    /*
     * PRUEBA SENSOR DE BATERIA 8.1:
     * Los motores permanecen en NEUTRO durante toda la prueba
     * para validar primero la medicion de PC1 / ADC1_INP11.
     */
    if (motores_pwm_activos != 0U)
    {
        motor_babor_pwm_us = PWM_NEUTRO;
        motor_estribor_pwm_us = PWM_NEUTRO;

        USV_Motor_Set(
            &htim3,
            TIM_CHANNEL_1,
            motor_babor_pwm_us);

        USV_Motor_Set(
            &htim3,
            TIM_CHANNEL_4,
            motor_estribor_pwm_us);
    }

    /*
     * PRUEBA SENSOR DE TEMPERATURA DS18B20:
     * PC2 = TEMPE = bus 1-Wire.
     * La libreria realiza internamente la conversion y devuelve grados Celsius.
     * Se actualiza cada 2 s. TEMPE_Read() es bloqueante durante ~750 ms.
     */
    if ((HAL_GetTick() - temperatura_last_ms) >= 2000U)
    {
        temperatura_last_ms = HAL_GetTick();
        temperatura_c = TEMPE_Read();
    }

    /*
     * TELEPLOT SEGURO:
     * Se divide la salida en bloques pequenos y se usa snprintf()
     * para evitar que una sola cadena grande desborde el buffer texto.
     */
    if ((HAL_GetTick() - teleplot_last_ms) >= 200U)
    {
        float humedad_pct;
        int len;

        teleplot_last_ms = HAL_GetTick();

        /*
         * SENSOR DE CORRIENTE LEM HASS 200-S:
         * PA0 = ADC1_INP0 = adc1_codigo[0].
         * Se conserva intacta la libreria corriente_lem.
         */
        corriente_adc_raw = adc1_codigo[0];
        corriente_voltaje_v =
            ((float)corriente_adc_raw / STM32_ADC_MAX_CODES) *
            STM32_ADC_VREF;
        corriente_lem_a =
            LEM_HASS200_ObtenerCorriente(corriente_adc_raw);

        /*
         * SENSOR DE VOLTAJE DE BATERIA:
         * PC1 = ADC1_INP11 = adc1_codigo[1].
         * Divisor nominal: R1=20 kOhm, R2=4.7 kOhm.
         * Factor nominal = (20k + 4.7k) / 4.7k = 5.255.
         *
         * Para esta primera prueba se usa el factor nominal y se compara
         * contra el multimetro antes de aplicar cualquier calibracion.
         */
        bateria_adc_raw = adc1_codigo[1];
        bateria_adc_v =
            ((float)bateria_adc_raw / 4095.0f) * 3.3f;
        bateria_voltaje_v =
            bateria_adc_v * 5.255f;

