RAFHA2413/Control_Navegacion_USV_STM32H562VGT6_v03/Core/Src/main.c
        /*
         * INTEGRACION $PUSVD 9.1:
         * Convierte las mediciones electricas al formato x10 de la trama.
         * Se preservan temperatura e inundacion hasta integrarlas en su etapa.
         */
        {
            float bateria_tx_v = bateria_voltaje_v;
            float corriente_tx_a = corriente_lem_a;
            uint16_t bateria_tx_x10;
            uint16_t corriente_tx_x10;

            if (bateria_tx_v < 0.0f)
            {
                bateria_tx_v = 0.0f;
            }
            else if (bateria_tx_v > 15.0f)
            {
                bateria_tx_v = 15.0f;
            }

            if (corriente_tx_a < 0.0f)
            {
                corriente_tx_a = 0.0f;
            }
            else if (corriente_tx_a > 100.0f)
            {
                corriente_tx_a = 100.0f;
            }

            bateria_tx_x10 =
                (uint16_t)((bateria_tx_v * 10.0f) + 0.5f);

            corriente_tx_x10 =
                (uint16_t)((corriente_tx_a * 10.0f) + 0.5f);

            TELEMETRIA_USV_SENSORES(
                &TELEMETRIA1,
                TELEMETRIA1.datos.temperatura_x10,
                TELEMETRIA1.datos.inundacion,
                bateria_tx_x10,
                corriente_tx_x10);
        }

        humedad_pct =
            ((4095.0f - (float)adc1_codigo[2]) * 100.0f) /
            (4095.0f - 1466.0f);

        if (humedad_pct < 0.0f)
        {
            humedad_pct = 0.0f;
        }
        else if (humedad_pct > 100.0f)
        {
            humedad_pct = 100.0f;
        }

        /* Bloque 1: sensores basicos y servo. */
        len = snprintf(
            texto,
            sizeof(texto),
            ">humedad_adc:%u\r\n"
            ">humedad_pct:%.1f\r\n"
            ">temperatura_c:%.2f\r\n"
            ">servo_angulo:%.1f\r\n"
            ">servo_pwm_us:%lu\r\n"
            ">motores_pwm_activos:%u\r\n"
            ">motor_babor_pwm_us:%u\r\n"
            ">motor_estribor_pwm_us:%u\r\n",
            (unsigned int)adc1_codigo[2],
            humedad_pct,
            temperatura_c,
            servo_test_angulo,
            (unsigned long)TIM3->CCR3,
            (unsigned int)motores_pwm_activos,
            (unsigned int)motor_babor_pwm_us,
            (unsigned int)motor_estribor_pwm_us);

        if ((len > 0) && ((size_t)len < sizeof(texto)))
        {
            uartx_write_text(&huart6, texto);
        }

        /* Bloque 2: diagnostico IMU. */
        len = snprintf(
            texto,
            sizeof(texto),
            ">imu_ok:%u\r\n"
            ">imu_addr:%u\r\n"
            ">imu_data_ok:%u\r\n"
            ">roll:%.2f\r\n"
            ">pitch:%.2f\r\n"
            ">yaw:%.2f\r\n",
            (unsigned int)imu_ok,
            (unsigned int)imu_addr,
            (unsigned int)imu_data_ok,
            imu_roll,
            imu_pitch,
            imu_yaw);

        if ((len > 0) && ((size_t)len < sizeof(texto)))
        {
            uartx_write_text(&huart6, texto);
        }

        /* Bloque 3: estado de recepcion GNSS. */
        len = snprintf(
            texto,
            sizeof(texto),
            ">gnss_rx_eventos:%lu\r\n"
            ">gnss_rx_bytes:%u\r\n"
            ">gps_rmc_ok:%u\r\n"
            ">gps_gga_ok:%u\r\n"
            ">gps_fix:%d\r\n"
            ">gps_satelites:%d\r\n"
            ">gps_hdop:%.2f\r\n",
            (unsigned long)gnss_rx_eventos,
            (unsigned int)GNSS_UARTRX.num_datos,
            (unsigned int)gps_rmc_ok,
            (unsigned int)gps_gga_ok,
            (int)gps_modo,
            (int)gps_satelites,
            gps_hor_dilu);

        if ((len > 0) && ((size_t)len < sizeof(texto)))
        {
            uartx_write_text(&huart6, texto);
        }

        /* Bloque 4: datos de navegacion GNSS. */
        len = snprintf(
            texto,
            sizeof(texto),
            ">gps_latitud:%.6f\r\n"
            ">gps_longitud:%.6f\r\n"
            ">gps_altitud_m:%.2f\r\n"
            ">gps_velocidad_kph:%.2f\r\n"
            ">gps_rumbo:%.2f\r\n",
            latitud,
            longitud,
            gps_altura,
            gps_vel_kph,
            gps_rumbo);

        if ((len > 0) && ((size_t)len < sizeof(texto)))
        {
            uartx_write_text(&huart6, texto);
        }

        /* Bloque 5: sensor de corriente LEM por PA0 / ADC1_INP0. */
        len = snprintf(
            texto,
            sizeof(texto),
            ">corriente_adc:%u\r\n"
            ">corriente_voltaje_v:%.3f\r\n"
            ">corriente_a:%.2f\r\n",
            (unsigned int)corriente_adc_raw,
            corriente_voltaje_v,
            corriente_lem_a);

        if ((len > 0) && ((size_t)len < sizeof(texto)))
        {
            uartx_write_text(&huart6, texto);
        }

        /* Bloque 6: voltaje de bateria por PC1 / ADC1_INP11. */
        len = snprintf(
            texto,
            sizeof(texto),
            ">bateria_adc:%u\r\n"
            ">bateria_adc_v:%.3f\r\n"
            ">bateria_voltaje_v:%.2f\r\n",
            (unsigned int)bateria_adc_raw,
            bateria_adc_v,
            bateria_voltaje_v);

        if ((len > 0) && ((size_t)len < sizeof(texto)))
        {
            uartx_write_text(&huart6, texto);
        }
    }

    /* Envío a Teleplot cada 200 ms */
    /* if ((HAL_GetTick() - teleplot_last_ms) >= 200U)
    {
        teleplot_last_ms = HAL_GetTick();

        int len = snprintf(
            teleplot_tx,
            sizeof(teleplot_tx),
            ">imu_ok:%u\r\n"
            ">imu_addr:%u\r\n"
            ">imu_data_ok:%u\r\n"
            ">roll:%.2f\r\n"
            ">pitch:%.2f\r\n"
            ">yaw:%.2f\r\n"
            ">rx_eventos:%lu\r\n"
            ">tramas_validas:%lu\r\n"
            ">camara_rx:%d\r\n"
            ">servo_ccr3:%lu\r\n"
            ">pb2_estado:%u\r\n"
            ">enlace_tierra:%u\r\n",
            (unsigned int)imu_ok,
            (unsigned int)imu_addr,
            (unsigned int)imu_data_ok,
            imu_roll,
            imu_pitch,
            imu_yaw,
            (unsigned long)usv_rx_eventos,
            (unsigned long)usv_tramas_validas,
            (int)usv_camara_recibida,
            (unsigned long)TIM3->CCR3,
            (unsigned int)HAL_GPIO_ReadPin(
                LED_RX_TIERRA_GPIO_Port,
                LED_RX_TIERRA_Pin),
            (unsigned int)led_rx_activo);

        if (len > 0)
        {
            HAL_UART_Transmit(
                &huart6,
                (uint8_t *)teleplot_tx,
                (uint16_t)len,
                100U);
        }
    } */

