RAFHA2413/Control_Navegacion_USV_STM32H562VGT6_v03/Core/Src/main.c
    /*
     * RECEPCION $PUSVU DESDE TIERRA POR USART1:
     *
     * La captura sigue la misma filosofia usada en gps.c:
     * se recibe una cadena ASCII y se separa por campos delimitados por comas.
     * trama_usv.c realiza esa separacion mediante USV_SepararCampos() y
     * USV_LeerComando() valida exactamente:
     *
     * $PUSVU,babor,estribor,camara,bomba,parada\r\n
     *
     * En esta etapa 9.2 solo se valida y decodifica la trama.
     * La aplicacion de las ordenes a motores, servo y bomba se habilitara
     * despues de comprobar primero la recepcion directa por cable.
     */
    if (GPS_UARTRX.flag_rx == 1)
    {
        int len_rx;

        comando_tierra_valido =
            USV_LeerComando(
                (const char *)GPS_UARTRX.trama_rx,
                &comando_tierra);

        if (comando_tierra_valido != 0U)
        {
            len_rx = snprintf(
                texto,
                sizeof(texto),
                ">pusvu_ok:1\r\n"
                ">cmd_babor:%u\r\n"
                ">cmd_estribor:%u\r\n"
                ">cmd_camara:%d\r\n"
                ">cmd_bomba:%u\r\n"
                ">cmd_parada:%u\r\n",
                (unsigned int)comando_tierra.potencia_babor,
                (unsigned int)comando_tierra.potencia_estribor,
                (int)comando_tierra.camara,
                (unsigned int)comando_tierra.bomba,
                (unsigned int)comando_tierra.parada);
        }
        else
        {
            len_rx = snprintf(
                texto,
                sizeof(texto),
                ">pusvu_ok:0\r\n");
        }

        if ((len_rx > 0) && ((size_t)len_rx < sizeof(texto)))
        {
            uartx_write_text(&huart6, texto);
        }

        HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);

        /* Reinicia ReceiveToIdle para recibir la siguiente trama. */
        uartRX_DMA_Re_init(&GPS_UARTRX);
    }

    /*
     * GPS L76K / USART2:
     * La libreria gps.c busca RMC y GGA dentro del buffer NMEA recibido.
     * Los indicadores gps_rmc_ok / gps_gga_ok quedan enclavados cuando
     * se obtiene por primera vez una sentencia valida con solucion.
     */
    if (GNSS_UARTRX.flag_rx == 1)
    {
        uint8_t rmc_ok;
        uint8_t gga_ok;

        gnss_rx_eventos++;

        rmc_ok = GPS_RMC();
        gga_ok = GPS_GGA();

        if (rmc_ok != 0U)
        {
            gps_rmc_ok = 1U;
        }

        if (gga_ok != 0U)
        {
            gps_gga_ok = 1U;
        }

        uartRX_DMA_Re_init(&GNSS_UARTRX);
    }

    /*
     * PRUEBA SOLICITADA POR EL PROFESOR:
     * PB2 parpadea aproximadamente a 2 Hz mientras se siguen recibiendo
     * tramas desde la estacion de tierra.
     */
    if (led_rx_activo != 0U)
    {
        uint32_t ahora_led = HAL_GetTick();

        if ((uint32_t)(ahora_led - led_rx_ultimo_evento_ms) > 400U)
        {
            /* No han llegado tramas recientemente: detiene el parpadeo. */
            led_rx_activo = 0U;
            HAL_GPIO_WritePin(
                LED_RX_TIERRA_GPIO_Port,
                LED_RX_TIERRA_Pin,
                GPIO_PIN_RESET);
        }
        else if ((uint32_t)(ahora_led - led_rx_ultimo_toggle_ms) >= 250U)
        {
            led_rx_ultimo_toggle_ms = ahora_led;

            HAL_GPIO_TogglePin(
                LED_RX_TIERRA_GPIO_Port,
                LED_RX_TIERRA_Pin);
        }
    }

    /* Envia $PUSVD hacia tierra cada 500 ms. */
    TELEMETRIA_USV_Tarea(&TELEMETRIA1);

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_PCLK3;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the programming delay
  */
  __HAL_FLASH_SET_PROGRAM_DELAY(FLASH_PROGRAMMING_DELAY_1);
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Common config
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_ASYNC_DIV1;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  hadc1.Init.LowPowerAutoWait = DISABLE;
  hadc1.Init.ContinuousConvMode = ENABLE;
  hadc1.Init.NbrOfConversion = 3;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.DMAContinuousRequests = ENABLE;
  hadc1.Init.SamplingMode = ADC_SAMPLING_MODE_NORMAL;
  hadc1.Init.Overrun = ADC_OVR_DATA_PRESERVED;
  hadc1.Init.OversamplingMode = DISABLE;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

